; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v8 - type_3 ?v4 - type_1)
 	      (pred_2 ?v6 - object ?v4 - type_1)
	      (pred_3 ?v8 - type_3 ?v7 - type_2)
	      (pred_4 ?v8 - type_3 ?v6 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v8 - type_3 ?v2 ?v3 - type_1)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v3)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_3
       :parameters (?v8 - type_3 ?v1 - object ?v5 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v5) (pred_1 ?v8 ?v5) (pred_3 ?v8 ?v7))
       :effect (and (pred_4 ?v8 ?v1 ?v7)
		    (not (pred_2 ?v1 ?v5)) 
		    (not (pred_3 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_3 ?v1 - object ?v5 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v1 ?v7) (pred_1 ?v8 ?v5))
       :effect (and (pred_2 ?v1 ?v5)
		    (pred_3 ?v8 ?v7)
		    (not (pred_4 ?v8 ?v1 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_1
obj_08 obj_02 - type_2
obj_07 obj_06 obj_01 - type_3
obj_04 obj_03 obj_05 - object)
(:init
(pred_1 obj_09 obj_06)
(pred_3 obj_09 obj_08)
(pred_3 obj_09 obj_02)
(pred_2 obj_04 obj_06)
(pred_2 obj_03 obj_07)
(pred_2 obj_05 obj_01)
)
(:goal
(and
(pred_2 obj_04 obj_06)
(pred_2 obj_03 obj_07)
(pred_2 obj_05 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_09 ?b obj_02))))
)
)

; plan
1. (op_1 obj_09 obj_06 obj_01)
   deleted: (pred_1 obj_09 obj_06)
   added: (pred_1 obj_09 obj_01)
   goals met: 2 of 3
2. (op_3 obj_09 obj_05 obj_01 obj_08)
   deleted: (pred_2 obj_05 obj_01) (pred_3 obj_09 obj_08)
   added: (pred_4 obj_09 obj_05 obj_08)
   goals met: 2 of 3
3. (op_1 obj_09 obj_01 obj_06)
   deleted: (pred_1 obj_09 obj_01)
   added: (pred_1 obj_09 obj_06)
   goals met: 2 of 3
4. (op_2 obj_09 obj_05 obj_06 obj_08)
   deleted: (pred_4 obj_09 obj_05 obj_08)
   added: (pred_2 obj_05 obj_06) (pred_3 obj_09 obj_08)
   goals met: 3 of 3
